research/visualization_methods/outputs/Invertible Neural Network Tutorial__invertible_neural_network_classifier/invertible_neural_network_classifier.mmd
graph TD
  Flow["Flow"]
  MvNormalMeanPrecision["MvNormalMeanPrecision"]
  Probit["Probit"]
  dot["dot"]
  k["k"]
  x["x"]
  x_lat["x_lat"]
  y["y"]
  y_lat1["y_lat1"]
  y_lat2["y_lat2"]
  Flow --> y_lat1
  MvNormalMeanPrecision --> x_lat
  Probit --> y
  dot --> y_lat2
  k --> x_lat
  k --> y
  k --> y_lat1
  k --> y_lat2
  x --> x_lat
  x_lat --> y_lat1
  y_lat1 --> y_lat2
  y_lat2 --> y
